/*
Дана последовательность натуральных чисел, завершающаяся числом 0.
Определите, какое наибольшее число подряд идущих элементов этой последовательности равны друг другу.
Если не нашлось ни одной пары, тройки и т.д. элементов,
равных друг другу, то программа должна вывести число 1.

Формат входных данных
Вводится последовательность натуральных чисел, оканчивающаяся числом 0
(само число 0 в последовательность не входит, а служит как признак ее окончания).

Формат выходных данных
Выведите ответ на задачу.

Sample Input:

1
7
7
9
1
0

Sample Output:

2
 */

#include <iostream>

using namespace std;

int main() {
    int n, max = 1, prev_N, prev_max = -1;
    cin >> n;
    while (n != 0) {
        prev_N = n;
        cin >> n;
        if (prev_N == n) {
            max++;
        } else if (prev_max < max) {
            prev_max = max;
            max = 1;
        } else {
            max = 1;
        }
    }
    if (prev_max > max) {
        cout << prev_max;
    } else {
        cout << max;
    }
    return 0;
}